from re import compile
keywords = {
    "red": [
        compile("[лЛ]учш[А-Я|а-я]+"),
        compile("[пП]ерв[А-Я|а-я]+"),
        compile("[сС]ам[А-Я|а-я]+"),
        compile("[лЛ]идер[А-Я|а-я]+"),
        compile("[фФ]лагман[А-Я|а-я]+"),
        compile("[гГ]арант[А-Я|а-я]+"),
        compile("[иИ]деал[А-Я|а-я]+"),
        compile("[иИ]деальн[А-Я|а-я]+"),
        compile("[аА]бсолют[А-Я|а-я]+"),
        compile("[иИ]сключитель[А-Я|а-я]+"),
        compile("[сС]овершенн[А-Я|а-я]+"),
        compile("[еЕ]динственн[А-Я|а-я]+"),
        compile("номер 1"),
        compile(
            "sale",
        ),
        compile("discount"),
    ],
    "orange": [
        compile('[уУ]никальн[А-Я|а-я]+'),
        compile('[оО]птимальн[А-Я|а-я]+'),
        compile('[бБ]есподобн[А-Я|а-я]+'),
        compile('[нН]епревзойденн[А-Я|а-я]+'),
        compile('[вВ]осхитительн[А-Я|а-я]+'),
        compile('[пП]рекрасн[А-Я|а-я]+'),
    ],
}